OpenFOAM-3.0.0/tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeaterRadiation/constant/bottomAir/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

writeViewFactorMatrix     true;
writeFacesAgglomeration   true;
writePatchViewFactors     false;

bottomAir_to_heater
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}

bottomAir_to_leftSolid
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}

bottomAir_to_rightSolid
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}

minX
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}

minY
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}

minZ
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}

maxX
{
    nFacesInCoarsestLevel     10;
    featureAngle              10;
}

maxZ
{
    nFacesInCoarsestLevel     20;
    featureAngle              10;
}


// ************************************************************************* //
